[
    {
       "id": "1",
       "image_path": "",
       "recipe_title": "Chicken Pot Pie",
       "description": "A delicious, homemade chicken pot pie made from scratch with carrots, peas, and celery. This comfort food classic will be a hit with your family.",
       "directions": "1. Boil the cubed chicken with the carrots, peas, and celery for about 15 minutes. Drain and set aside. Cook the onions in butter until they're translucent, then stir in the flour and seasonings. Add the chicken broth and milk and simmer until the filling is thick. \n\n2. Place the chicken-vegetable mixture in an unbaked pie crust. Pour the chicken broth mixture over it. Cover with the top crust, seal the edges, and cut slits in the top to allow the steam to escape. Bake until the pastry is golden brown and the filling is bubbly. 3.Allow the pie to cool completely before storage. Wrap the cooled pie tightly in aluminum foil and refrigerate for three to five days. Reheat in the oven or in short bursts in the microwave.",
       "user_id": "5",
       "public": true
    },
    {
        "id": "2",
        "image_path": "/recipe-images/123754345.jpg",
        "recipe_title": "Chicken Chile Verde and White Bean Soup",
        "description": "A quick, spicy chicken and white bean soup using salsa verde and pantry ingredients. A terrific use for leftover chicken or turkey. ",
        "directions": "To a pot over medium heat, add the broth, chicken, beans, salsa, and cumin. Heat through. Meanwhile, prepare your toppings. When the soup is hot, season with salt and pepper to taste. Ladle soup into bowls and top with toppings of your choice.",
        "user_id": "4",
        "public": true
     },
     {
        "id": "3",
        "image_path": "",
        "recipe_title": "Broccoli Cheddar Mac 'n' Cheese",
        "description": "Broccoli + cheddar + mac 'n' cheese = amazing.",
        "directions": "Prepare 1 box of Mac 'N' Cheese according instructions on box. Add cooked broccoli, cheddar cheese, and pepper stir until fully incorporated. Top with desired garnish. Serve immediately.",
        "user_id": "3",
        "public": true
     },
     {
        "id": "4",
        "image_path": "",
        "recipe_title": "Chicken Vesuvio for Two",
        "description": "Chicken Vesuvio is a classic Chicago restaurant dish: crisp-skinned chicken and deeply browned potatoes in a potent garlic and white wine sauce.",
        "directions": "1. Adjust oven rack to upper-middle position and heat oven to 450 degrees. Pat chicken dry with paper towels and sprinkle on both sides with ¾ teaspoon salt and ¼ teaspoon pepper. Toss potatoes with 1½ teaspoons oil and ½ teaspoon salt. Mince whole garlic clove and immediately combine with lemon juice in small bowl; set aside. \n\n2. Heat remaining 1½ teaspoons oil in 12-inch oven-safe skillet over medium-high heat until shimmering. Place chicken, skin side down, in single layer in skillet and cook, without moving it, until chicken has rendered about 2 tablespoons of fat, about 2 minutes. Place potatoes cut side down in chicken fat, arranging so that cut sides are in complete contact with surface of skillet. Sprinkle chicken and potatoes with oregano and thyme. Continue to cook until chicken and potatoes are deeply browned and crisp, 6 to 8 minutes longer, moving chicken and potatoes to ensure even browning and flipping pieces when fully browned. When all pieces have been flipped, tuck halved garlic cloves among chicken and potatoes. Remove skillet from heat and pour wine into skillet (do not pour over chicken or potatoes). Return pan to heat and bring to boil. Transfer skillet to oven and roast until potatoes are tender when pierced with tip of paring knife and chicken registers 185 to 190 degrees, 15 to 20 minutes. \n\n3. Transfer chicken and potatoes to deep platter, browned sides up. Place skillet over medium heat (handle will be hot) and stir to incorporate any browned bits. Using slotted spoon, transfer garlic cloves to cutting board. Chop coarse, then mash to smooth paste with side of knife. Whisk garlic paste into sauce. Continue to cook until sauce coats back of spoon, 2 to 3 minutes longer. Remove from heat and whisk in reserved lemon juice mixture and 1½ teaspoons parsley. Pour sauce around chicken and potatoes. Sprinkle with remaining 1½ teaspoons parsley and serve.",
        "user_id": "2",
        "public": true
     },
     {
      "id": "5",
      "image_path": "/recipe-images/1754363458.webp",
      "recipe_title": "Easy Swedish Meatballs",
      "description": "These Swedish meatballs are the best you'll ever have. Gently warmed with spices and covered in a heavenly creamy gravy sauce, then served with fluffy mashed potatoes!",
      "directions": "1. Mix your Swedish meatball ingredients in a large bowl and roll them out onto a sheet pan.\n\n2. Fry the meatballs in a large pan.\n\n3. Use the same pan to make your gravy.\n\n4. Add the meatballs back to the pan and serve in that creamy, spiced Swedish meatball sauce!",
      "user_id": "1",
      "public": true
   }
]